%传递函数实现：多项式，零极点，GH求闭传

clc,clear

% 开环传递函数实现，多项式
%|          M(s)          s + 2
%|  G(s) = ——— = ————————
%|          N(s)      s^2 + 2s + 3

Ms = [1 , 10];
Ns = [1, 2, 3];

Gs = tf(Ms, Ns);



%  根轨迹增益 + 零极点
%|          M(s)             K'(s - 2)
%|  G(s) = ——— = ——————————————
%|          N(s)     ( s - 1 )( s - 3 )( s - 4 ) 


K = 6;
Z = [ 2 ];
P = [ 1 , 3 , 4 ];

Gs = zpk(Z,P,K);  
%这个函数名也很有意思，就是zpk，零极点增益，参数。




%  反馈系统，开传，G(s)H(s)，求闭传，先搞出来G(s)和H(s)

Gs = tf(1,[1,1]);
Hs = tf(1,1);

Fs = feedback(Gs,Hs);  %第三个参数默认-1，正反馈为1



